ViniBR01/stm32-bare-metal/apps/cli/test_harness.c
void test_flash_erase_scratch_sector(void)
{
    err_t ret = flash_unlock();
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_unlock() failed");

    ret = flash_erase_sector(FLASH_TEST_SECTOR);
    flash_lock();
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_erase_sector() failed");

    /* Verify erased state: first 32 bytes should all be 0xFF */
    uint8_t buf[32];
    flash_read_bytes(FLASH_TEST_BASE_ADDR, buf, sizeof(buf));
    for (uint32_t i = 0; i < sizeof(buf); i++) {
        TEST_ASSERT_EQUAL_HEX8_MESSAGE(0xFF, buf[i],
            "Erased flash byte not 0xFF");
    }
}

void test_flash_write_word_readback(void)
{
    /* Write to offset 0x00 and 0x04 (already erased by previous test) */
    flash_unlock();

    err_t ret = flash_write_word(FLASH_TEST_BASE_ADDR, 0xDEADBEEFU);
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_write_word() failed");

    ret = flash_write_word(FLASH_TEST_BASE_ADDR + 4U, 0xCAFEBABEU);
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_write_word(+4) failed");

    flash_lock();

    uint32_t val0, val1;
    flash_read_word(FLASH_TEST_BASE_ADDR, &val0);
    flash_read_word(FLASH_TEST_BASE_ADDR + 4U, &val1);

    TEST_ASSERT_EQUAL_HEX32_MESSAGE(0xDEADBEEFU, val0,
        "Word readback mismatch at base");
    TEST_ASSERT_EQUAL_HEX32_MESSAGE(0xCAFEBABEU, val1,
        "Word readback mismatch at base+4");
}

void test_flash_write_bytes_readback(void)
{
    /* Write to offset 0x100 to avoid clobbering the word test above */
    const uint32_t addr = FLASH_TEST_BASE_ADDR + 0x100U;

    static const uint8_t pattern[] = {
        0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08,
        0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0, 0x55, 0xAA
    };

    flash_unlock();
    err_t ret = flash_write_bytes(addr, pattern, sizeof(pattern));
    flash_lock();
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_write_bytes() failed");

    uint8_t readback[16];
    flash_read_bytes(addr, readback, sizeof(readback));
    TEST_ASSERT_EQUAL_HEX8_ARRAY_MESSAGE(pattern, readback, sizeof(pattern),
        "Byte pattern readback mismatch");
}

void test_flash_sector_info(void)
{
    TEST_ASSERT_EQUAL_HEX32(FLASH_TEST_BASE_ADDR,
                            flash_get_sector_address(FLASH_TEST_SECTOR));
    TEST_ASSERT_EQUAL_UINT32(128U * 1024U,
                             flash_get_sector_size(FLASH_TEST_SECTOR));
}

/* ====================================================================
 * CRC hardware tests — Tier 7
 *
 * The STM32F411 CRC peripheral uses polynomial 0x04C11DB7 (MPEG-2),
 * initial value 0xFFFFFFFF, no output XOR, no bit reversal.
 * Pure internal peripheral — no external wiring required.
 * ==================================================================== */

/* Software CRC-32/MPEG-2 reference for cross-validation */
static uint32_t sw_crc32_mpeg2_word(const uint32_t *data, uint32_t len)
{
    uint32_t crc = 0xFFFFFFFFU;
    for (uint32_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (int bit = 0; bit < 32; bit++) {
            if (crc & 0x80000000U) {
                crc = (crc << 1) ^ 0x04C11DB7U;
            } else {
                crc = crc << 1;
            }
        }
    }
    return crc;
}

void test_crc_hw_known_vector(void)
{
    static const uint32_t vec[] = {0x00000001, 0x00000002, 0x00000003,
                                   0x04050607, 0x08090A0B, 0x0C0D0E0F};
    uint32_t expected = sw_crc32_mpeg2_word(vec, 6);

    crc_init();
    crc_reset();
    uint32_t hw_result = crc_accumulate(vec, 6);

    TEST_ASSERT_EQUAL_HEX32_MESSAGE(expected, hw_result,
        "HW CRC does not match software reference for known vector");
}

void test_crc_hw_reset_restores_init(void)
{
    static const uint32_t data[] = {0xDEADBEEF, 0xCAFEBABE};
    crc_init();
    crc_accumulate(data, 2);

    crc_reset();
    uint32_t result = crc_get_result();
    TEST_ASSERT_EQUAL_HEX32_MESSAGE(0xFFFFFFFFU, result,
        "CRC reset did not restore accumulator to 0xFFFFFFFF");
}

void test_crc_hw_accumulate_matches_sequential(void)
{
    static const uint32_t data[] = {0x11223344, 0x55667788, 0x99AABBCC, 0xDDEEFF00};

    crc_init();
    crc_reset();
    uint32_t bulk = crc_accumulate(data, 4);

    crc_reset();
    for (uint32_t i = 0; i < 4; i++) {
        crc_accumulate(&data[i], 1);
    }
    uint32_t sequential = crc_get_result();

    TEST_ASSERT_EQUAL_HEX32_MESSAGE(bulk, sequential,
        "Bulk accumulate != sequential word-by-word");
}

void test_crc_hw_flash_region(void)
{
    crc_init();
    crc_reset();
    uint32_t result1 = crc_accumulate((const uint32_t *)0x08000000U, 256);

    TEST_ASSERT_NOT_EQUAL_HEX32_MESSAGE(0U, result1,
        "CRC of flash region should not be zero");
    TEST_ASSERT_NOT_EQUAL_HEX32_MESSAGE(0xFFFFFFFFU, result1,
        "CRC of flash region should not be init value");

    /* Determinism: same input must give same output */
    crc_reset();
    uint32_t result2 = crc_accumulate((const uint32_t *)0x08000000U, 256);
    TEST_ASSERT_EQUAL_HEX32_MESSAGE(result1, result2,
        "CRC of same flash region not deterministic");
}

void test_crc_hw_performance(void)
{
    static uint32_t perf_buf[1024];
    for (uint32_t i = 0; i < 1024; i++) {
        perf_buf[i] = i * 0x01010101U;
    }

    /* Enable DWT cycle counter */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

    crc_init();
    crc_reset();

    uint32_t start = DWT->CYCCNT;
    crc_accumulate(perf_buf, 1024);
    uint32_t elapsed = DWT->CYCCNT - start;

    /* CRC peripheral takes 4 AHB cycles per word. With loop overhead
     * (load, store, branch), expect ~6 cycles/word = ~6144 for 1024 words.
     * Allow generous margin for pipeline and flash wait states. */
    TEST_ASSERT_UINT32_WITHIN_MESSAGE(
        3000U, 6200U, elapsed,
        "CRC of 1024 words took too many cycles");

    printf("  [perf] CRC 1024 words: %lu cycles (%.1f cycles/word)\n",
           (unsigned long)elapsed, (float)elapsed / 1024.0f);
}

/* ====================================================================
 * Stop mode test — Tier 8
 *
 * Uses EXTI software trigger on line 7 (PB7) to wake immediately from
 * Stop mode without external wiring or hang risk. After wake, the PLL
 * is restored to 100 MHz and systick re-initialised.
 * ==================================================================== */

void test_stop_mode_enter_and_wake(void)
{
    /* Configure PB7 as input, enable EXTI line 7 rising edge */
    gpio_clock_enable(GPIO_PORT_B);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_INPUT);
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_RISING,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret, "EXTI config for stop wake failed");

