ViniBR01/stm32-bare-metal/apps/cli/test_harness.c
static q15_t modem_shape_samp[MODEM_BER_BLOCK * MODEM_SHAPE_SPS];
static rrc_t modem_shape_tx;
static rrc_t modem_shape_rx;

void test_modem_bpsk_ber_awgn_shaped(void)
{
    prbs_t       tx;
    prbs_check_t chk;
    awgn_prng_t  rng;

    prbs_init(&tx, PRBS9, MODEM_BER_SEED);
    prbs_check_init(&chk, PRBS9, MODEM_BER_SEED);
    awgn_prng_seed(&rng, MODEM_BER_SEED);

    rrc_design(&modem_shape_tx, MODEM_SHAPE_BETA, MODEM_SHAPE_SPS, MODEM_SHAPE_SPAN);
    rrc_design(&modem_shape_rx, MODEM_SHAPE_BETA, MODEM_SHAPE_SPS, MODEM_SHAPE_SPAN);

    const uint32_t sps = MODEM_SHAPE_SPS;
    const size_t   delay_samples = rrc_chain_delay(&modem_shape_tx);
    const size_t   tail_syms = delay_samples / sps + 1u;
    const uint32_t total_syms = MODEM_BER_NBITS + (uint32_t)tail_syms;

    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    uint32_t gen_cyc = 0, mod_cyc = 0, shape_cyc = 0, chan_cyc = 0,
             match_cyc = 0, demod_cyc = 0, check_cyc = 0;
    uint64_t errors = 0;

    size_t   sample_base = 0;
    size_t   next_peak   = delay_samples;
    uint32_t produced    = 0;
    uint32_t sym_done    = 0;

    while (sym_done < total_syms) {
        uint32_t n = total_syms - sym_done;
        if (n > MODEM_BER_BLOCK) {
            n = MODEM_BER_BLOCK;
        }
        uint32_t payload_n = 0;
        if (sym_done < MODEM_BER_NBITS) {
            payload_n = MODEM_BER_NBITS - sym_done;
            if (payload_n > n) {
                payload_n = n;
            }
        }

        uint32_t t0 = DWT->CYCCNT;
        if (payload_n > 0u) {
            prbs_next_bits(&tx, modem_tx_block, payload_n);
        }
        uint32_t t1 = DWT->CYCCNT;
        for (uint32_t i = 0; i < payload_n; i++) {
            modem_sym_block[i] = bpsk_map(modem_tx_block[i]);
        }
        for (uint32_t i = payload_n; i < n; i++) {
            modem_sym_block[i] = 0;
        }
        uint32_t t2 = DWT->CYCCNT;
        rrc_tx_shape(&modem_shape_tx, modem_sym_block, n, modem_shape_samp);
        uint32_t t3 = DWT->CYCCNT;
        channel_awgn_apply(modem_shape_samp, (size_t)n * sps, MODEM_BER_SNR_DB, &rng);
        uint32_t t4 = DWT->CYCCNT;
        rrc_rx_match(&modem_shape_rx, modem_shape_samp, (size_t)n * sps, modem_shape_samp);
        uint32_t t5 = DWT->CYCCNT;
        uint32_t dec_n = 0;
        for (uint32_t p = 0; p < n * sps; p++) {
            if (sample_base + p == next_peak && (produced + dec_n) < MODEM_BER_NBITS) {
                modem_rx_block[dec_n++] = bpsk_slice(modem_shape_samp[p]);
                next_peak += sps;
            }
        }
        uint32_t t6 = DWT->CYCCNT;
        for (uint32_t i = 0; i < dec_n; i++) {
            if (!prbs_check_bit(&chk, modem_rx_block[i])) {
                errors++;
            }
        }
        uint32_t t7 = DWT->CYCCNT;

        gen_cyc   += t1 - t0;
        mod_cyc   += t2 - t1;
        shape_cyc += t3 - t2;
        chan_cyc  += t4 - t3;
        match_cyc += t5 - t4;
        demod_cyc += t6 - t5;
        check_cyc += t7 - t6;

        produced    += dec_n;
        sample_base += (size_t)n * sps;
        sym_done    += n;
    }

    uint32_t cycles      = gen_cyc + mod_cyc + shape_cyc + chan_cyc +
                           match_cyc + demod_cyc + check_cyc;
    uint64_t total       = produced;   /* compared symbols (== NBITS once flushed) */
    uint32_t ber_ppm     = (total > 0u) ? (uint32_t)((errors * 1000000ull) / total) : 0u;
    double   theory      = channel_awgn_theory_ber(MODEM_BER_SNR_DB);
    uint32_t theory_ppm  = (uint32_t)(theory * 1.0e6 + 0.5);
    uint32_t cyc_per_bit = (total > 0u) ? (uint32_t)(cycles / total) : 0u;

    int ber_ok = (theory_ppm > 0u) &&
                 (ber_ppm >= theory_ppm / 2u) && (ber_ppm <= theory_ppm * 2u);
    int cyc_ok = (cyc_per_bit <= MODEM_SHAPE_CYC_PER_BIT_BUDGET);
    int pass   = ber_ok && cyc_ok;

    /* Gated main line + report-only per-stage breakdown, flushed individually
     * (see the unshaped test for why).  Per-stage value is cyc/1000-bits. */
    TEST_OUTPUT_RESULT("modem_shaped_ber_snr6", pass, cycles, "ber_ppm", ber_ppm);
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_shaped_cyc_gen",   1, gen_cyc,   "cyc_per_kbit",
                       (uint32_t)((uint64_t)gen_cyc   * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_shaped_cyc_mod",   1, mod_cyc,   "cyc_per_kbit",
                       (uint32_t)((uint64_t)mod_cyc   * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_shaped_cyc_shape", 1, shape_cyc, "cyc_per_kbit",
                       (uint32_t)((uint64_t)shape_cyc * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_shaped_cyc_chan",  1, chan_cyc,  "cyc_per_kbit",
                       (uint32_t)((uint64_t)chan_cyc  * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_shaped_cyc_match", 1, match_cyc, "cyc_per_kbit",
                       (uint32_t)((uint64_t)match_cyc * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_shaped_cyc_demod", 1, demod_cyc, "cyc_per_kbit",
                       (uint32_t)((uint64_t)demod_cyc * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_shaped_cyc_check", 1, check_cyc, "cyc_per_kbit",
                       (uint32_t)((uint64_t)check_cyc * 1000u / total));
    printf_dma_flush();

    printf("  [modem/rrc] BER=%.3e theory=%.3e cyc/bit=%lu bits=%lu\n",
           (double)ber_ppm / 1.0e6, theory, (unsigned long)cyc_per_bit,
           (unsigned long)total);
    printf_dma_flush();

    TEST_ASSERT_TRUE_MESSAGE(ber_ok, "Shaped BPSK BER outside factor-2 band of theory");
    TEST_ASSERT_TRUE_MESSAGE(cyc_ok, "Shaped BPSK modem cyc/bit over budget");
}

/* ====================================================================
 * Main test runner
 * ==================================================================== */

int run_unity_tests(void) {
    UNITY_BEGIN();

    /* ----------------------------------------------------------
     * Tier 1: Smoke test — all 5 SPIs at max speed
     *   prescaler=2, 256 bytes, polled + DMA
     * ---------------------------------------------------------- */
    printf("\n--- Tier 1: All-SPI smoke (psc=2, 256B) ---\n");
    printf_dma_flush();

    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 256, 0);   /* SPI1 polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 256, 1);   /* SPI1 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 256, 0);   /* SPI2 polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 256, 1);   /* SPI2 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_3, 2, 256, 0);   /* SPI3 polled */
    RUN_SPI_TEST(SPI_INSTANCE_3, 2, 256, 1);   /* SPI3 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_4, 2, 256, 0);   /* SPI4 polled */
    RUN_SPI_TEST(SPI_INSTANCE_4, 2, 256, 1);   /* SPI4 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_5, 2, 256, 0);   /* SPI5 polled */
    RUN_SPI_TEST(SPI_INSTANCE_5, 2, 256, 1);   /* SPI5 DMA    */

    /* ----------------------------------------------------------
     * Tier 2a: Deep sweep — SPI2 (APB1, 50 MHz bus)
     *   Prescaler sweep: 2, 4, 8, 16, 32, 64, 128, 256
     *   Buffer sizes: 1, 4, 16, 64, 256
     *   Both polled and DMA
     *
     *   Full matrix is 8×5×2 = 80 tests. We select a representative
     *   subset: all prescalers at 256B, all sizes at prescaler=2,
     *   plus DMA mirrors. This gives thorough coverage with ~30 tests.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 2a: SPI2 (APB1 50MHz) deep sweep ---\n");
    printf_dma_flush();

    /* Prescaler sweep at 256 bytes — polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 4,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 8,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 16,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 32,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 64,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 128, 256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 256, 256, 0);

    /* Prescaler sweep at 256 bytes — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 4,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 8,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 16,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 32,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 64,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 128, 256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 256, 256, 1);

    /* Buffer size sweep at prescaler=2 — polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 1,   0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 4,   0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 16,  0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 64,  0);

    /* Buffer size sweep at prescaler=2 — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 1,   1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 4,   1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 16,  1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 64,  1);

    /* ----------------------------------------------------------
     * Tier 2b: Deep sweep — SPI1 (APB2, 100 MHz bus)
     *   Same test matrix structure as SPI2.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 2b: SPI1 (APB2 100MHz) deep sweep ---\n");
    printf_dma_flush();

    /* Prescaler sweep at 256 bytes — polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 4,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 8,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 16,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 32,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 64,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 128, 256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 256, 256, 0);

    /* Prescaler sweep at 256 bytes — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 4,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 8,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 16,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 32,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 64,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 128, 256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 256, 256, 1);

    /* Buffer size sweep at prescaler=2 — polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 1,   0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 4,   0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 16,  0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 64,  0);

    /* Buffer size sweep at prescaler=2 — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 1,   1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 4,   1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 16,  1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 64,  1);

    /* ----------------------------------------------------------
     * Tier 3: Non-SPI hardware tests
     * ---------------------------------------------------------- */
    printf("\n--- Tier 3: FPU tests ---\n");
    printf_dma_flush();

    RUN_TEST(test_fpu_multiplication);
    RUN_TEST(test_fpu_division);

    /* ----------------------------------------------------------
     * Tier 4: RCC and Timer hardware tests
     * ---------------------------------------------------------- */
    printf("\n--- Tier 4: RCC clock tree ---\n");
    printf_dma_flush();

    RUN_TEST(test_rcc_sysclk_is_100mhz);
    RUN_TEST(test_rcc_apb1_clk_is_50mhz);
    RUN_TEST(test_rcc_apb2_clk_is_100mhz);
    RUN_TEST(test_rcc_apb1_timer_clk_is_100mhz);

    printf("\n--- Tier 4: Timer delay accuracy ---\n");
    printf_dma_flush();

    RUN_TEST(test_timer_delay_us_accuracy);

    /* ----------------------------------------------------------
     * Tier 4: SysTick tests
     *   systick_init() is called by main() at startup, so the counter
     *   is already running when these tests execute.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 4: SysTick tests ---\n");
    printf_dma_flush();

    RUN_TEST(test_systick_get_ms_increments);
    RUN_TEST(test_systick_elapsed_since);
    RUN_TEST(test_systick_delay_ms_accuracy);

    /* ----------------------------------------------------------
     * Tier 5: UART loopback hardware tests
     *   USART1: PA9 (TX/AF7) wired to PB7 (RX/AF7)
     *   USART6: PC6 (TX/AF8) wired to PC7 (RX/AF8)
     *   115200 baud, polled, no DMA/interrupts.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: USART1 loopback (PA9/PB7) ---\n");
    printf_dma_flush();

